[
    "Always declare local variables with let or const.",
    "Use === instead of == to avoid type coercion and unexpected results.",
    "Functions are first-class objects in JavaScript.",
    "Use arrow functions for concise syntax and to avoid issues with this.",
    "Use template literals to easily create complex strings.",
    "Async/await makes asynchronous code cleaner and easier to read.",
    "Use destructuring to extract values from arrays or objects.",
    "argument object created with any arguments",
    "Variables declared with 'var' are function-scoped or globally-scoped and are hoisted to the top of their scope.",
    "The 'let' keyword declares a block-scoped local variable, optionally initializing it to a value.",
    "The 'const' keyword declares a block-scoped variable that cannot be reassigned.",
    "Arrow functions provide a concise syntax and lexically bind the 'this' value.",
    "Template literals are string literals allowing embedded expressions and multi-line strings.",
    "Promises are objects representing the eventual completion or failure of an asynchronous operation.",
    "Destructuring assignment allows unpacking values from arrays or properties from objects into distinct variables.",
    "The spread syntax allows an iterable such as an array to be expanded where zero or more arguments are expected.",
    "Async functions provide a simpler and cleaner way to handle asynchronous code, using the async and await keywords.",
    "The nullish coalescing operator (??) is a logical operator that returns its right-hand side operand when its left-hand side operand is null or undefined.",
    "Optional chaining (?.) allows you to safely access deeply nested properties of an object without having to check for the existence of each reference in the chain.",
    "An Immediately Invoked Function Expression (IIFE) is a JavaScript function that runs as soon as it is defined.",
    "Closures are functions that have access to the parent scope, even after the parent function has closed.",
    "The 'this' keyword refers to the object it belongs to, and its value can change depending on the context in which it is used.",
    "The Document Object Model (DOM) is a programming interface for HTML and XML documents that represents the page so that programs can change the document structure, style, and content.",
    "The 'addEventListener' method attaches an event handler to the specified element without overwriting existing event handlers.",
    "JavaScript's 'call' method calls a function with a given 'this' value and arguments provided individually.",
    "The 'apply' method calls a function with a given 'this' value, and arguments provided as an array (or an array-like object).",
    "The 'bind' method creates a new function that, when called, has its 'this' keyword set to the provided value.",
    "JavaScript is single-threaded, meaning it has only one call stack and can do one thing at a time.",
    "JavaScript uses lexical scoping, where a variable defined in a parent scope is available to its child scopes.",
    "Hoisting is JavaScript's default behavior of moving declarations to the top of the current scope.",
    "Execution context is the environment in which JavaScript code is executed, consisting of the variable object, scope chain, and 'this'.",
    "The prototype chain is used to build new types of objects based on existing ones.",
    "Type coercion is the automatic or implicit conversion of values from one data type to another.",
    "Closures are functions that remember their lexical scope even when executed outside of that lexical scope.",
    "The event loop is a design pattern used in JavaScript to handle asynchronous operations.",
    "Currying is the process of transforming a function with multiple arguments into a sequence of functions with a single argument.",
    "The module pattern is a design pattern used to create encapsulated code blocks in JavaScript.",
    "Higher-order functions are functions that take other functions as arguments or return them as results.",
    "Callback functions are functions that are passed into other functions as arguments to be executed later.",
    "Promises are used to handle asynchronous operations in JavaScript, providing an alternative to callbacks.",
    "The fetch API provides an interface for fetching resources (including across the network).",
    "The Event Delegation pattern allows us to handle events efficiently by using a single event listener.",
    "Immutable data patterns involve using non-modifying methods that return new instances of data.",
    "The 'this' keyword refers to an object that's set at the creation of a new execution context (function invocation).",
    "The 'new' keyword is used to create an instance of an object that has a constructor function.",
    "A pure function is a function where the return value is only determined by its input values, without observable side effects.",
    "Memoization is an optimization technique used to speed up function calls by caching the results.",
    "The 'call stack' is a stack data structure that stores information about the active subroutines of a computer program."
    
]